MorgothCreator/mSdk/SDK/platform/stm32f10x/interface/twi_interface.c
/*
 * twi_interface.c
 *
 * Created: 2/8/2013 5:00:27 PM
 *  Iulian Gheorghiu <morgoth.creator@gmail.com>
 */
/*#####################################################*/
#include "stdlib.h"
#include "stm32f10x_conf.h"
#include "include/stm32f10x.h"
#include "twi_interface.h"
#include "driver/stm32f10x_i2c.h"
#include "driver/stm32f10x_dma.h"
#include "api/timer_api.h"
#include "api/twi_def.h"
#include "gpio_interface.h"

new_twi* TwiStructure[3] 						= {NULL, NULL, NULL};

#define sEE_I2C_DMA                      		DMA1
DMA_Channel_TypeDef *sEE_I2C_DMA_CHANNEL_TX[]   = {DMA1_Channel6, DMA1_Channel4, DMA1_Channel2};
DMA_Channel_TypeDef *sEE_I2C_DMA_CHANNEL_RX[]   = {DMA1_Channel7, DMA1_Channel5, DMA1_Channel3};
uint32_t sEE_I2C1_DMA_FLAG_TX_TC[]        		= {DMA1_IT_TC6, DMA1_IT_TC4, DMA1_IT_TC2};
uint32_t sEE_I2C1_DMA_FLAG_TX_GL[]        		= {DMA1_IT_GL6, DMA1_IT_GL4, DMA1_IT_GL2};
uint32_t sEE_I2C1_DMA_FLAG_RX_TC[]        		= {DMA1_IT_TC7, DMA1_IT_TC5, DMA1_IT_TC3};
uint32_t sEE_I2C1_DMA_FLAG_RX_GL[]        		= {DMA1_IT_GL7, DMA1_IT_GL5, DMA1_IT_GL3};
#define sEE_I2C_DMA_CLK                  		RCC_AHBPeriph_DMA1
uint32_t sEE_I2C_DR_Address[]            		= {((uint32_t)0x40005410), ((uint32_t)0x40005410), ((uint32_t)0x40005410)};
#define sEE_USE_DMA

unsigned char sEE_I2C_DMA_TX_IRQn[]       		= {DMA1_Channel6_IRQn, DMA1_Channel4_IRQn, DMA1_Channel2_IRQn};
unsigned char sEE_I2C_DMA_RX_IRQn[]       		= {DMA1_Channel7_IRQn, DMA1_Channel5_IRQn, DMA1_Channel3_IRQn};
#define sEE_I2C1_DMA_TX_IRQHandler        		DMA1_Channel6_IRQHandler
#define sEE_I2C1_DMA_RX_IRQHandler        		DMA1_Channel7_IRQHandler
#define sEE_I2C2_DMA_TX_IRQHandler        		DMA1_Channel4_IRQHandler
#define sEE_I2C2_DMA_RX_IRQHandler        		DMA1_Channel5_IRQHandler
#define sEE_I2C3_DMA_TX_IRQHandler        		DMA1_Channel2_IRQHandler
#define sEE_I2C3_DMA_RX_IRQHandler        		DMA1_Channel3_IRQHandler
#define sEE_I2C_DMA_PREPRIO              		0
#define sEE_I2C_DMA_SUBPRIO              		0

#define sEE_DIRECTION_TX                 		0
#define sEE_DIRECTION_RX                 		1
#define USE_I2C_TX_DMA

bool TwiTransmitComplete[] = {false, false, false};
bool TwiReceive[] = {false, false, false};

/* Maximum Timeout values for flags and events waiting loops. These timeouts are
   not based on accurate values, they just guarantee that the application will
   not remain stuck if the I2C communication is corrupted.
   You may modify these timeout values depending on CPU frequency and application
   conditions (interrupts routines ...). */
#define sEE_FLAG_TIMEOUT         				((uint32_t)0x1000)
#define sEE_LONG_TIMEOUT         				((uint32_t)(10 * sEE_FLAG_TIMEOUT))


DMA_InitTypeDef   sEEDMA_InitStructure[3];
//#####################################################
#define I2Cn                             2
I2C_TypeDef *sEE_I2C[] = {I2C1
#ifdef I2C2
		, I2C2
#endif
#ifdef I2C3
		, I2C3
#endif
};

const uint32_t I2C_CLK[] = {RCC_APB1Periph_I2C1
#ifdef RCC_APB1Periph_I2C2
		, RCC_APB1Periph_I2C2
#endif
#ifdef RCC_APB1Periph_I2C3
		, RCC_APB1Periph_I2C3
#endif
};

/**
  * @brief  Start critical section: these callbacks should be typically used
  *         to disable interrupts when entering a critical section of I2C communication
  *         You may use default callbacks provided into this driver by uncommenting the
  *         define USE_DEFAULT_CRITICAL_CALLBACK.
  *         Or you can comment that line and implement these callbacks into your
  *         application.
  * @param  None.
  * @retval None.
  */
void sEE_EnterCriticalSection_UserCallback(void)
{
  __disable_irq();
}

/**
  * @brief  Start and End of critical section: these callbacks should be typically used
  *         to re-enable interrupts when exiting a critical section of I2C communication
  *         You may use default callbacks provided into this driver by uncommenting the
  *         define USE_DEFAULT_CRITICAL_CALLBACK.
  *         Or you can comment that line and implement these callbacks into your
  *         application.
  * @param  None.
  * @retval None.
  */
void sEE_ExitCriticalSection_UserCallback(void)
{
  __enable_irq();
}
/**
  * @brief  This function handles the DMA Tx Channel interrupt Handler.
  * @param  None
  * @retval None
  */
void sEE_I2C_DMA_TX_IRQHandler(unsigned char TwiNr)
{
  /* Check if the DMA transfer is complete */
  if(DMA_GetFlagStatus(sEE_I2C1_DMA_FLAG_TX_TC[TwiNr]) != RESET)
  {
    /* Disable the DMA Tx Channel and Clear all its Flags */
    DMA_Cmd(sEE_I2C_DMA_CHANNEL_TX[TwiNr], DISABLE);
    DMA_ClearFlag(sEE_I2C1_DMA_FLAG_TX_GL[TwiNr]);

    /*!< Wait till all data have been physically transferred on the bus */
    uint32_t  sEETimeout = sEE_LONG_TIMEOUT;
    while(!I2C_GetFlagStatus(sEE_I2C[TwiNr], I2C_FLAG_BTF))
    {
      if((sEETimeout--) == 0)
    	  return;
    }

    /*!< Send STOP condition */
    if(TwiReceive[TwiNr] == false)
    	I2C_GenerateSTOP(sEE_I2C[TwiNr], ENABLE);

    /* Perform a read on SR1 and SR2 register to clear eventualaly pending flags */
    (void)sEE_I2C[TwiNr]->SR1;
    (void)sEE_I2C[TwiNr]->SR2;

    /* Reset the variable holding the number of data to be written */
    TwiStructure[TwiNr]->bytesToWrite = 0;
    TwiTransmitComplete[TwiNr] = true;
  }
}

/**
  * @brief  This function handles the DMA Rx Channel interrupt Handler.
  * @param  None
  * @retval None
  */
void sEE_I2C_DMA_RX_IRQHandler(unsigned char TwiNr)
{
  /* Check if the DMA transfer is complete */
  if(DMA_GetFlagStatus(sEE_I2C1_DMA_FLAG_RX_TC[TwiNr]) != RESET)
  {
    /*!< Send STOP Condition */
	  I2C_GenerateSTOP(sEE_I2C[TwiNr], ENABLE);

    /* Disable the DMA Rx Channel and Clear all its Flags */
    DMA_Cmd(sEE_I2C_DMA_CHANNEL_RX[TwiNr], DISABLE);
    DMA_ClearFlag(sEE_I2C1_DMA_FLAG_RX_GL[TwiNr]);

    /* Reset the variable holding the number of data to be read */
    TwiStructure[TwiNr]->bytesToRead = 0;
  }
}

void sEE_I2C1_DMA_TX_IRQHandler(void) {
	sEE_I2C_DMA_TX_IRQHandler(0);
}
void sEE_I2C1_DMA_RX_IRQHandler(void) {
	sEE_I2C_DMA_RX_IRQHandler(0);
}

void sEE_I2C2_DMA_TX_IRQHandler(void) {
	sEE_I2C_DMA_TX_IRQHandler(1);
}
void sEE_I2C2_DMA_RX_IRQHandler(void) {
	sEE_I2C_DMA_RX_IRQHandler(1);
}

void sEE_I2C3_DMA_TX_IRQHandler(void) {
	sEE_I2C_DMA_TX_IRQHandler(2);
}
void sEE_I2C3_DMA_RX_IRQHandler(void) {
	sEE_I2C_DMA_RX_IRQHandler(2);
}

/**
  * @brief  DeInitializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_LowLevel_DeInit(new_twi* TwiStruct)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

  /* sEE_I2C Peripheral Disable */
  I2C_Cmd(sEE_I2C[TwiStruct->TwiNr], DISABLE);

  /* sEE_I2C DeInit */
  I2C_DeInit(sEE_I2C[TwiStruct->TwiNr]);

  /*!< sEE_I2C Periph clock disable */
  RCC_APB1PeriphClockCmd(I2C_CLK[TwiStruct->TwiNr], DISABLE);

  /*!< GPIO configuration */
  /*!< Configure sEE_I2C pins: SCL */
  GPIO_InitStructure.GPIO_Pin = 1 << TwiStruct->SclPin;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GET_GPIO_PORT_ADDR[TwiStruct->SclPort], &GPIO_InitStructure);

  /*!< Configure sEE_I2C pins: SDA */
  GPIO_InitStructure.GPIO_Pin = 1 << TwiStruct->SdaPin;
  GPIO_Init(GET_GPIO_PORT_ADDR[TwiStruct->SdaPort], &GPIO_InitStructure);

