MorgothCreator/mSdk/SDK/platform/stm32f10x/interface/twi_interface.c
  /* Configure and enable I2C DMA TX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_TX_IRQn[TwiStruct->TwiNr];
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* Configure and enable I2C DMA RX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_RX_IRQn[TwiStruct->TwiNr];
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  NVIC_Init(&NVIC_InitStructure);

  /* Disable and Deinitialize the DMA channels */
  DMA_Cmd(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr], DISABLE);
  DMA_Cmd(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr], DISABLE);
  DMA_DeInit(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr]);
  DMA_DeInit(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr]);
}
//#####################################################
/**
  * @brief  Initializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_LowLevel_Init(new_twi* TwiStruct)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

  /*!< sEE_I2C_SCL_GPIO_CLK and sEE_I2C_SDA_GPIO_CLK Periph clock enable */
  RCC_APB2PeriphClockCmd(GET_PORT_CLK_ADDR[TwiStruct->SclPort] | GET_PORT_CLK_ADDR[TwiStruct->SdaPort], ENABLE);

  /*!< sEE_I2C Periph clock enable */
  RCC_APB1PeriphClockCmd(I2C_CLK[TwiStruct->TwiNr], ENABLE);

  /*!< GPIO configuration */
  /*!< Configure sEE_I2C pins: SCL */
  GPIO_InitStructure.GPIO_Pin = 1 << TwiStruct->SclPin;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
  GPIO_Init(GET_GPIO_PORT_ADDR[TwiStruct->SclPort], &GPIO_InitStructure);

  /*!< Configure sEE_I2C pins: SDA */
  GPIO_InitStructure.GPIO_Pin = 1 << TwiStruct->SdaPin;
  GPIO_Init(GET_GPIO_PORT_ADDR[TwiStruct->SdaPort], &GPIO_InitStructure);

  /* Configure and enable I2C DMA TX Channel interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_TX_IRQn[TwiStruct->TwiNr];
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Configure and enable I2C DMA RX Channel interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_RX_IRQn[TwiStruct->TwiNr];
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
    NVIC_Init(&NVIC_InitStructure);

    /*!< I2C DMA TX and RX channels configuration */
    /* Enable the DMA clock */
    RCC_AHBPeriphClockCmd(sEE_I2C_DMA_CLK, ENABLE);

    /* I2C TX DMA Channel configuration */
    DMA_DeInit(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr]);
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_PeripheralBaseAddr = (uint32_t)&sEE_I2C[TwiStruct->TwiNr]->DR;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_MemoryBaseAddr = (uint32_t)0;   /* This parameter will be configured durig communication */
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_DIR = DMA_DIR_PeripheralDST;    /* This parameter will be configured durig communication */
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_BufferSize = 0xFFFF;            /* This parameter will be configured durig communication */
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_MemoryInc = DMA_MemoryInc_Enable;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_Mode = DMA_Mode_Normal;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_Priority = DMA_Priority_VeryHigh;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_M2M = DMA_M2M_Disable;
    DMA_Init(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr], &sEEDMA_InitStructure[TwiStruct->TwiNr]);

    /* I2C RX DMA Channel configuration */
    DMA_DeInit(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr]);
    DMA_Init(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr], &sEEDMA_InitStructure[TwiStruct->TwiNr]);

    /* Enable the DMA Channels Interrupts */
    DMA_ITConfig(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr], DMA_IT_TC, ENABLE);
    DMA_ITConfig(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr], DMA_IT_TC, ENABLE);
}
/**
  * @brief  Initializes DMA channel used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_LowLevel_DMAConfig(unsigned char TwiNr, uint32_t pBuffer, uint32_t BufferSize, uint32_t Direction)
{
  /* Initialize the DMA with the new parameters */
  if (Direction == sEE_DIRECTION_TX)
  {
    /* Configure the DMA Tx Channel with the buffer address and the buffer size */
    sEEDMA_InitStructure[TwiNr].DMA_MemoryBaseAddr = (uint32_t)pBuffer;
    sEEDMA_InitStructure[TwiNr].DMA_DIR = DMA_DIR_PeripheralDST;
    sEEDMA_InitStructure[TwiNr].DMA_BufferSize = (uint32_t)BufferSize;
    DMA_Init(sEE_I2C_DMA_CHANNEL_TX[TwiNr], &sEEDMA_InitStructure[TwiNr]);
  }
  else
  {
    /* Configure the DMA Rx Channel with the buffer address and the buffer size */
    sEEDMA_InitStructure[TwiNr].DMA_MemoryBaseAddr = (uint32_t)pBuffer;
    sEEDMA_InitStructure[TwiNr].DMA_DIR = DMA_DIR_PeripheralSRC;
    sEEDMA_InitStructure[TwiNr].DMA_BufferSize = (uint32_t)BufferSize;
    DMA_Init(sEE_I2C_DMA_CHANNEL_RX[TwiNr], &sEEDMA_InitStructure[TwiNr]);
  }
}
//#####################################################
//#include "int/int_twi.h"
/**
  * @brief  Reads a block of data from the EEPROM.
  * @param  pBuffer : pointer to the buffer that receives the data read from
  *         the EEPROM.
  * @param  ReadAddr : EEPROM's internal address to start reading from.
  * @param  NumByteToRead : pointer to the variable holding number of bytes to
  *         be read from the EEPROM.
  *
  *        @note The variable pointed by NumByteToRead is reset to 0 when all the
  *              data are read from the EEPROM. Application should monitor this
  *              variable in order know when the transfer is complete.
  *
  * @note When number of data to be read is higher than 1, this function just
  *       configures the communication and enable the DMA channel to transfer data.
  *       Meanwhile, the user application may perform other tasks.
  *       When number of data to be read is 1, then the DMA is not used. The byte
  *       is read in polling mode.
  *
  * @retval sEE_OK (0) if operation is correctly performed, else return value
  *         different from sEE_OK (0) or the timeout user callback.
  */
uint32_t TWI_MasterWriteRead(new_twi* TwiStruct, unsigned int TransmitBytes, unsigned int ReceiveBytes)
{
	uint32_t sEETimeout;
	/* Set the pointer to the Number of data to be read. This pointer will be used
      by the DMA Transfer Completer interrupt Handler in order to reset the
      variable to 0. User should check on this variable in order to know if the
      DMA transfer has been complete or not. */
	if(ReceiveBytes)
		TwiReceive[TwiStruct->TwiNr] = true;
	else
		TwiReceive[TwiStruct->TwiNr] = false;

	uint16_t NumByteToRead = ReceiveBytes;
	I2C_TypeDef *I2Cx = sEE_I2C[TwiStruct->TwiNr];
	/* If bus is freeze we will reset the unit and restore the settings. */
	if(I2C_GetFlagStatus(sEE_I2C[TwiStruct->TwiNr], I2C_FLAG_AF | I2C_FLAG_ARLO) || (I2Cx->CR1 & (1 << 8))) {
		  /* sEE_I2C Peripheral Enable */
		I2C_TypeDef I2CxBack;
		I2CxBack.CR1 = I2Cx->CR1;
		I2CxBack.CR2 = I2Cx->CR2;
		I2CxBack.OAR1 = I2Cx->OAR1;
		I2CxBack.OAR2 = I2Cx->OAR2;
		I2CxBack.CCR = I2Cx->CCR;
		I2CxBack.TRISE = I2Cx->TRISE;
		I2C_SoftwareResetCmd(sEE_I2C[TwiStruct->TwiNr], ENABLE);
		I2C_SoftwareResetCmd(sEE_I2C[TwiStruct->TwiNr], DISABLE);
		I2Cx->TRISE = I2CxBack.TRISE;
		I2Cx->CCR = I2CxBack.CCR;
		I2Cx->OAR2 = I2CxBack.OAR2;
		I2Cx->OAR1 = I2CxBack.OAR1;
		I2Cx->CR2 = I2CxBack.CR2;
		I2Cx->CR1 = I2CxBack.CR1;
	}
  /*!< While the bus is busy */
  sEETimeout = sEE_LONG_TIMEOUT * 10;
  timer(TimerBusyTimeout);
  timer_interval(&TimerBusyTimeout, TwiStruct->BusyTimeOut);
  timer_enable(&TimerBusyTimeout);
  while(I2C_GetFlagStatus(sEE_I2C[TwiStruct->TwiNr], I2C_FLAG_BUSY))
  {
	  if(timer_tick(&TimerBusyTimeout)) {
			I2C_TypeDef I2CxBack;
			I2CxBack.CR1 = I2Cx->CR1;
			I2CxBack.CR2 = I2Cx->CR2;
			I2CxBack.OAR1 = I2Cx->OAR1;
			I2CxBack.OAR2 = I2Cx->OAR2;
			I2CxBack.CCR = I2Cx->CCR;
			I2CxBack.TRISE = I2Cx->TRISE;
			I2C_SoftwareResetCmd(sEE_I2C[TwiStruct->TwiNr], ENABLE);
			I2C_SoftwareResetCmd(sEE_I2C[TwiStruct->TwiNr], DISABLE);
			I2Cx->TRISE = I2CxBack.TRISE;
			I2Cx->CCR = I2CxBack.CCR;
			I2Cx->OAR2 = I2CxBack.OAR2;
			I2Cx->OAR1 = I2CxBack.OAR1;
			I2Cx->CR2 = I2CxBack.CR2;
			I2Cx->CR1 = I2CxBack.CR1;
			break;
		}
  }

  /*!< Send START condition */
  I2C_GenerateSTART(sEE_I2C[TwiStruct->TwiNr], ENABLE);

  /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
  sEETimeout = sEE_FLAG_TIMEOUT;
  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_MODE_SELECT))
  {
		if((sEETimeout--) == 0) {
			/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
			(void)sEE_I2C[TwiStruct->TwiNr]->SR1;
			(void)sEE_I2C[TwiStruct->TwiNr]->SR2;
			return false;
		}
  }

  /*!< Send EEPROM address for write */
  I2C_Send7bitAddress(sEE_I2C[TwiStruct->TwiNr], TwiStruct->MasterSlaveAddr << 1, I2C_Direction_Transmitter);

  /*!< Test on EV6 and clear it */
  sEETimeout = sEE_FLAG_TIMEOUT;
  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
		if((sEETimeout--) == 0) {
			/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
			(void)sEE_I2C[TwiStruct->TwiNr]->SR1;
			(void)sEE_I2C[TwiStruct->TwiNr]->SR2;
			return false;
		}
  }


