MorgothCreator/mSdk/SDK/platform/stm32f10x/interface/twi_interface.c
  if(!TwiStruct->UseDma) {
	  unsigned int cnt = 0;
	  for(; cnt < TransmitBytes; cnt++)
	  {
		  /*!< Send the EEPROM's internal address to read from: MSB of the address first */
		  I2C_SendData(sEE_I2C[TwiStruct->TwiNr], TwiStruct->TxBuff[cnt]);

		  /*!< Test on EV8 and clear it */
		  sEETimeout = sEE_FLAG_TIMEOUT;
		  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_BYTE_TRANSMITTED))
		  {
				if((sEETimeout--) == 0) {
					/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
					(void)sEE_I2C[TwiStruct->TwiNr]->SR1;
					(void)sEE_I2C[TwiStruct->TwiNr]->SR2;
					return false;
				}
		  }
	  }
  } else {
	  TwiTransmitComplete[TwiStruct->TwiNr] = false;
	  /* Configure the DMA Tx Channel with the buffer address and the buffer size */
	  sEE_LowLevel_DMAConfig(TwiStruct->TwiNr, (uint32_t)TwiStruct->TxBuff, (uint32_t)(TransmitBytes), sEE_DIRECTION_TX);
	  /* Enable the DMA Tx Channel */
	  DMA_Cmd(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr], ENABLE);
	  /*!< Test on EV8 and clear it */
	  sEETimeout = sEE_FLAG_TIMEOUT;
	  while(!TwiTransmitComplete[TwiStruct->TwiNr])
	  {
			if((sEETimeout--) == 0) {
				return false;
			}
	  }
  }

  if(ReceiveBytes) {
	  /* If number of data to be read is 1, then DMA couldn't be used */
	  /* One Byte Master Reception procedure (POLLING) ---------------------------*/
	  if (NumByteToRead < 2)
	  {
		  /*!< Send STRAT condition a second time */
		  I2C_GenerateSTART(sEE_I2C[TwiStruct->TwiNr], ENABLE);

		  /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
		  sEETimeout = sEE_FLAG_TIMEOUT;
		  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_MODE_SELECT))
		  {
				if((sEETimeout--) == 0) {
					return false;
				}
		  }

		  /*!< Send EEPROM address for read */
		  I2C_Send7bitAddress(sEE_I2C[TwiStruct->TwiNr], TwiStruct->MasterSlaveAddr << 1, I2C_Direction_Receiver);

		/* Wait on ADDR flag to be set (ADDR is still not cleared at this level */
		sEETimeout = sEE_FLAG_TIMEOUT;
		while(I2C_GetFlagStatus(sEE_I2C[TwiStruct->TwiNr], I2C_FLAG_ADDR) == RESET)
		{
			if((sEETimeout--) == 0) {
				return false;
			}
		}

		/*!< Disable Acknowledgement */
		I2C_AcknowledgeConfig(sEE_I2C[TwiStruct->TwiNr], DISABLE);

		/* Call User callback for critical section start (should typically disable interrupts) */
		sEE_EnterCriticalSection_UserCallback();

		/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
		(void)sEE_I2C[TwiStruct->TwiNr]->SR2;

		/*!< Send STOP Condition */
		I2C_GenerateSTOP(sEE_I2C[TwiStruct->TwiNr], ENABLE);

		/* Call User callback for critical section end (should typically re-enable interrupts) */
		sEE_ExitCriticalSection_UserCallback();

		/* Wait for the byte to be received */
		sEETimeout = sEE_FLAG_TIMEOUT;
		while(I2C_GetFlagStatus(sEE_I2C[TwiStruct->TwiNr], I2C_FLAG_RXNE) == RESET)
		{
			if((sEETimeout--) == 0) {
				return false;
			}
		}

		/*!< Read the byte received from the EEPROM */
		*TwiStruct->RxBuff = I2C_ReceiveData(sEE_I2C[TwiStruct->TwiNr]);

		/*!< Decrement the read bytes counter */
		NumByteToRead--;

		/* Wait to make sure that STOP control bit has been cleared */
		sEETimeout = sEE_FLAG_TIMEOUT;
		while(sEE_I2C[TwiStruct->TwiNr]->CR1 & I2C_CR1_STOP)
		{
			if((sEETimeout--) == 0) {
				return false;
			}
		}

		/*!< Re-Enable Acknowledgement to be ready for another reception */
		I2C_AcknowledgeConfig(sEE_I2C[TwiStruct->TwiNr], ENABLE);
	  }
	  else/* More than one Byte Master Reception procedure (DMA) -----------------*/
	  {
		  if(1/*!TwiStruct->UseDma*/) {
			  /*!< Send STRAT condition a second time */
			  I2C_GenerateSTART(sEE_I2C[TwiStruct->TwiNr], ENABLE);

			  /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
			  sEETimeout = sEE_FLAG_TIMEOUT;
			  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_MODE_SELECT))
			  {
					if((sEETimeout--) == 0) {
						return false;
					}
			  }

			  /*!< Send EEPROM address for read */
			  I2C_Send7bitAddress(sEE_I2C[TwiStruct->TwiNr], TwiStruct->MasterSlaveAddr << 1, I2C_Direction_Receiver);

			  /* If number of data to be read is 1, then DMA couldn't be used */
			  /* One Byte Master Reception procedure (POLLING) ---------------------------*/
			  //if (NumByteToRead < 2)
			  //{
				/* Wait on ADDR flag to be set (ADDR is still not cleared at this level */
				sEETimeout = sEE_FLAG_TIMEOUT;
				while(I2C_GetFlagStatus(sEE_I2C[TwiStruct->TwiNr], I2C_FLAG_ADDR) == RESET)
				{
					if((sEETimeout--) == 0) {
						return false;
					}
				}
				(void)sEE_I2C[TwiStruct->TwiNr]->SR2;

				  unsigned int cnt = 0;
				  for(; cnt < ReceiveBytes; cnt++)
				  {
					if(cnt == ReceiveBytes - 1)
					{
						/*!< Disable Acknowledgement */
						I2C_AcknowledgeConfig(sEE_I2C[TwiStruct->TwiNr], DISABLE);

						/* Call User callback for critical section start (should typically disable interrupts) */
						sEE_EnterCriticalSection_UserCallback();

						/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
						(void)sEE_I2C[TwiStruct->TwiNr]->SR2;

						/*!< Send STOP Condition */
						I2C_GenerateSTOP(sEE_I2C[TwiStruct->TwiNr], ENABLE);

						/* Call User callback for critical section end (should typically re-enable interrupts) */
						sEE_ExitCriticalSection_UserCallback();
					}

					/* Wait for the byte to be received */
					sEETimeout = sEE_FLAG_TIMEOUT;
					while(I2C_GetFlagStatus(sEE_I2C[TwiStruct->TwiNr], I2C_FLAG_RXNE) == RESET)
					{
						if((sEETimeout--) == 0) {
							return false;
						}
					}

					/*!< Read the byte received from the EEPROM */
					TwiStruct->RxBuff[cnt] = I2C_ReceiveData(sEE_I2C[TwiStruct->TwiNr]);
				  }

				/* Wait to make sure that STOP control bit has been cleared */
				sEETimeout = sEE_FLAG_TIMEOUT;
				while(sEE_I2C[TwiStruct->TwiNr]->CR1 & I2C_CR1_STOP)
				{
					if((sEETimeout--) == 0) {
						return false;
					}
				}

				/*!< Re-Enable Acknowledgement to be ready for another reception */
				I2C_AcknowledgeConfig(sEE_I2C[TwiStruct->TwiNr], ENABLE);
		  }
		  else {
			  /*!< Send STRAT condition a second time */
			  I2C_GenerateSTART(sEE_I2C[TwiStruct->TwiNr], ENABLE);

			  /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
			  sEETimeout = sEE_FLAG_TIMEOUT;
			  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_MODE_SELECT))
			  {
					if((sEETimeout--) == 0) {
						return false;
					}
			  }

			  /*!< Send Device address for read */
			  I2C_Send7bitAddress(sEE_I2C[TwiStruct->TwiNr], TwiStruct->MasterSlaveAddr << 1, I2C_Direction_Receiver);

			    /*!< Test on EV6 and clear it */
			    sEETimeout = sEE_FLAG_TIMEOUT;
			    while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
			    {
			      if((sEETimeout--) == 0)
			    	  return false;
			    }

			    /* Configure the DMA Rx Channel with the buffer address and the buffer size */
			    sEE_LowLevel_DMAConfig(TwiStruct->TwiNr, (uint32_t)TwiStruct->RxBuff, (uint32_t)(NumByteToRead), sEE_DIRECTION_RX);

			    /* Inform the DMA that the next End Of Transfer Signal will be the last one */
			    I2C_DMALastTransferCmd(sEE_I2C[TwiStruct->TwiNr], ENABLE);

			    /* Enable the DMA Rx Channel */
			    DMA_Cmd(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr], ENABLE);

